# 1. Поприветстовать игрока при входе в игру и объяснить правила игры
# 2. Создадим список слов, из которого случайно выберем слово
# 3. Задать число попыток (5)
# 4. Отгадывание букв:
#	 - выполнять программу, пока попытки не будут больше или равны 1 (while)
# 	 	- в переменную задать пользовательский ввод
# 		- если буква есть в слове
# 			- попытка убывает на одну 
# 			- выводим на экран, что буква есть в этом слове и оставшееся число попыток
# 		- если буквы нет в слове
# 			- попытка убывает на одну
# 			- вывести на экран, что такой буквы нет и оставшееся количество попыток
# 	 - когда закончатся все попытки, вывести на экран запрос на подсказку ("не знаю")
# 	 - создать пользовательский ввод для написания слова
# 	 - вполнять программу, пока наше слово не будет равно оригинальному слову
# 		- пользовательский ввод для ввода слова
# 		- если наше слово равно ориг.слову
# 			- вывести на экран поздравление
# 		- если наше слово равно "не знаю"
# 		- прервать цикл